import './About.scss';
import { useEffect } from 'react';

const About = () => {
  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);

  return (
    <div className='about-wrap'>
      <h1>Інтернет-магазин жіночого одягу «PurePure»</h1>
      <div className='about'>
        <p>
          Інтернет-магазин <span>«PurePure»</span> здійснює продаж жіночого
          одягу власного виробництва в м. Миколаїв та по Україні. Ми пропонуємо
          стильний і якісний одяг за справедливими цінами, оскільки вважаємо, що
          онлайн-шопінг має бути максимально комфортним і безпечним для наших
          клієнтів.
        </p>
        <p>
          PurePure є виробником, офіційним дистриб&#39;ютором та офіційною
          точкою продажу жіночого одягу. Це означає, що весь одяг, представлений
          у нашому інтернет-магазині, є оригінальним і має відповідну гарантію
          якості від нашого бренду.
        </p>
        <p>
          Перед відправкою кожен виріб обов&#39;язково перевіряється. Ми не
          відправляємо, який не пройшов перевірку на механічні пошкодження. Усі
          ціни та інформація по товару на сайті є актуальними!
        </p>

        <p>
          Ми прагнемо забезпечити індивідуальний підхід до кожного нашого
          клієнта, підлаштовуючи наші послуги та консультації під ваші потреби
          та бажання. Наші клієнти рекомендують нас за нашу професійність та
          якість товару.
        </p>

        <p>
          Будь-які додаткові запитання чи уточнення ви можете задати за
          контактним телефоном: <span>+38(050) 174-70-15</span>
        </p>
        <p>
          чи електронною поштою: <span>bizmailer24@gmail.com</span>
        </p>
        <ul>
          Графік роботи нашого інтернет-иагазину:
          <li>ПН-ПТ 9:00 - 17:00</li>
          <li>СБ-НД - вихідні</li>
        </ul>
        <p className='wait'>Чекаємо на Вас тут!</p>
      </div>
    </div>
  );
};

export default About;
